dungpk/stm32f401re-aplication/stm32f4xx_drivers/drivres/Inc/stm32f401_gpio_driver.h
/*
 * stm32f401_gpio_driver.h
 *
 *  Created on: 6 Jul 2021
 *      Author: cuong
 */

#ifndef INC_STM32F401_GPIO_DRIVER_H_
#define INC_STM32F401_GPIO_DRIVER_H_

#include "stm32f401xx.h"
/*
 * This is a Configuration structure for a GPIO pin
 */
typedef struct
{
	uint8_t GPIO_PinNumber;		/*!< possible values from @GPIO_PIN_NUMBERS >*/
	uint8_t GPIO_PinMode;		/*!< possible values from @GPIO_PIN_MODES >*/
	uint8_t GPIO_PinSpeed;		/*!< possible values from @GPIO_PIN_SPEED >*/
	uint8_t GPIO_PinPuPdControl;/*!< possible values from @GPIO_PIN_PUPD>*/
	uint8_t GPIO_PinOPType;		/*!< possible values from @GPIO_PIN_OPTYPES>*/
	uint8_t GPIO_PinAltFunMode;

}GPIO_PinConfig_t;

/*
 * This is a Handler structure for GPIO pin
 */
typedef struct
{
	//poiter to hold the base address of the GPIO peripheral
	GPIO_RegDef_t *pGPIOx; // This hold base address pf the GPIO port to which the pin belongs
	GPIO_PinConfig_t GPIO_PinConfig;  // This hold GPIO pin configuration settings
}GPIO_Hangle_t;
/*
 * @GPIO_PIN_NUMBERS
 * GPIO pin numbers
*/
#define GPIO_PIN_NO_0		0
#define GPIO_PIN_NO_1		1
#define GPIO_PIN_NO_2		2
#define GPIO_PIN_NO_3		3
#define GPIO_PIN_NO_4		4
#define GPIO_PIN_NO_5		5
#define GPIO_PIN_NO_6		6
#define GPIO_PIN_NO_7		7
#define GPIO_PIN_NO_8		8
#define GPIO_PIN_NO_9		9
#define GPIO_PIN_NO_10		10
#define GPIO_PIN_NO_11		11
#define GPIO_PIN_NO_12		12
#define GPIO_PIN_NO_13		13
#define GPIO_PIN_NO_14		14
#define GPIO_PIN_NO_15		15
/*
 * @GPIO_PIN_MODES
 * GPIO pin possible modes
 */
#define GPIO_MODE_IN		0
#define GPIO_MODE_OUT		1
#define GPIO_MODE_ALTFN		2
#define GPIO_MODE_ANALOG	3
#define GPIO_MODE_IT_FT		4
#define GPIO_MODE_IT_RT		5
#define GPIO_MODE_IT_RFT	6
/*
 * @GPIO_PIN_OPTYPES
 * GPIO pin possible output types
*/
#define GPIO_OP_TYPE_PP		0
#define GPIO_OP_TYPE_OD		1
/*
 * @GPIO_PIN_SPEED
 * GPIO pin possible output speed mode
*/
#define GPIO_MODE_SPEED_LOW		0
#define GPIO_MODE_SPEED_MEDIUM	1
#define GPIO_MODE_SPEED_FAST	2
#define GPIO_MODE_SPEED_HIGH	3
/*
 * @GPIO_PIN_PUPD
 * GPIO pin pull up and pull down configuration macros
*/
#define GPIO_NO_PUPD		0
#define GPIO_PIN_PU			1
#define GPIO_PIN_PD			2
#define GPIO_RESERVED		3

/******************************************************************************
 *                     APIS supported by this driver                          *
 *          For more information about the APIs check the function definition *
 ******************************************************************************/
/*
 * Peripheral Clock Setup
*/
void GPIO_PeriClockControl(GPIO_RegDef_t *pGPIOx, uint8_t EnorDi);
/*
 * Init and De Init
*/
void GPIO_Init(GPIO_Hangle_t *pGPIOHandle);
void GPIO_DeInit(GPIO_RegDef_t *pGPIOx);
/*
 *Data read and write
*/
uint8_t GPIO_ReadFromInputPin(GPIO_RegDef_t *pGPIOx, uint8_t PinNumber);
uint16_t GPIO_ReadFromInputPort(GPIO_RegDef_t *pGPIOx);
void GPIO_WriteOutputPin(GPIO_RegDef_t *pGPIOx, uint8_t PinNumber, uint8_t Value);
void GPIO_WriteOutputPort(GPIO_RegDef_t *pGPIOx,  uint16_t Value);
void GPIO_ToggleOutputPin(GPIO_RegDef_t *pGPIOx, uint8_t PinNumber);
/*
 *
 * IRQ Configuration and ISR handling
*/
void GPIO_IRQInterruptConfig(uint32_t IRQNumber, uint8_t EnorDi);
void GPIO_IRQPriorityConfig(uint8_t IRQNumber,uint32_t IRQPriority);
void GPIO_IRQHandling(uint8_t PinNumber);
#endif /* INC_STM32F401_GPIO_DRIVER_H_ */
